Here is the plan output for the branch that is still including the RestAPI provider to avoid the `URI definition` error so we can see what the plan is going to result in:
```
data.ibm_iam_auth_token.token_data: Reading...
module.resource_group.ibm_resource_group.resource_group[0]: Refreshing state... [id=16e34d5a4ea346d680f2db4bf8b10ad0]
data.ibm_iam_auth_token.token_data: Read complete after 0s [id=2023-02-07 18:07:36.157616 +0000 UTC]
module.key_protect_module.ibm_resource_instance.key_protect_instance: Refreshing state... [id=crn:v1:bluemix:public:kms:eu-gb:a/abac0df06b644a9cabc6e44f55b3880e:0eff8174-e741-4e35-b58d-ffcf549e2bce::]
module.key_protect_module.restapi_object.enable_metrics[0]: Refreshing state... [id=0eff8174-e741-4e35-b58d-ffcf549e2bce]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.key_protect_module.ibm_kms_instance_policies.key_protect_instance_policies will be created
  + resource "ibm_kms_instance_policies" "key_protect_instance_policies" {
      + id          = (known after apply)
      + instance_id = "0eff8174-e741-4e35-b58d-ffcf549e2bce"

      + dual_auth_delete {
          + created_by    = (known after apply)
          + creation_date = (known after apply)
          + enabled       = false
          + last_updated  = (known after apply)
          + updated_by    = (known after apply)
        }

      + key_create_import_access {
          + create_root_key     = true
          + create_standard_key = true
          + created_by          = (known after apply)
          + creation_date       = (known after apply)
          + enabled             = true
          + enforce_token       = false
          + import_root_key     = true
          + import_standard_key = true
          + last_updated        = (known after apply)
          + updated_by          = (known after apply)
        }

      + metrics {
          + created_by    = (known after apply)
          + creation_date = (known after apply)
          + enabled       = true
          + last_updated  = (known after apply)
          + updated_by    = (known after apply)
        }

      + rotation {
          + created_by     = (known after apply)
          + creation_date  = (known after apply)
          + enabled        = true
          + interval_month = 1
          + last_updated   = (known after apply)
          + updated_by     = (known after apply)
        }
    }

  # module.key_protect_module.restapi_object.enable_metrics[0] will be destroyed
  # (because restapi_object.enable_metrics is not in configuration)
  - resource "restapi_object" "enable_metrics" {
      - api_data        = {
          - "metadata"  = "map[collectionTotal:1 collectionType:application/vnd.ibm.kms.policy+json]"
          - "resources" = "[map[createdBy:IBMid-550003CSTW creationDate:2023-02-07T17:18:54Z lastUpdated:2023-02-07T17:48:28Z policy_data:map[enabled:true] policy_type:metrics updatedBy:IBMid-550003CSTW]]"
        } -> null
      - api_response    = jsonencode(
            {
              - metadata  = {
                  - collectionTotal = 1
                  - collectionType  = "application/vnd.ibm.kms.policy+json"
                }
              - resources = [
                  - {
                      - createdBy    = "IBMid-550003CSTW"
                      - creationDate = "2023-02-07T17:18:54Z"
                      - lastUpdated  = "2023-02-07T17:48:28Z"
                      - policy_data  = {
                          - enabled = true
                        }
                      - policy_type  = "metrics"
                      - updatedBy    = "IBMid-550003CSTW"
                    },
                ]
            }
        ) -> null
      - create_method   = "PUT" -> null
      - create_path     = "//eu-gb.kms.cloud.ibm.com/api/v2/instance/policies?policy=metrics" -> null
      - create_response = jsonencode(
            {
              - metadata  = {
                  - collectionTotal = 1
                  - collectionType  = "application/vnd.ibm.kms.policy+json"
                }
              - resources = [
                  - {
                      - createdBy    = "IBMid-550003CSTW"
                      - creationDate = "2023-02-07T17:18:54Z"
                      - lastUpdated  = "2023-02-07T17:48:28Z"
                      - policy_data  = {
                          - enabled = true
                        }
                      - policy_type  = "metrics"
                      - updatedBy    = "IBMid-550003CSTW"
                    },
                ]
            }
        ) -> null
      - data            = jsonencode(
            {
              - metadata  = {
                  - collectionTotal = 1
                  - collectionType  = "application/vnd.ibm.kms.policy+json"
                }
              - resources = [
                  - {
                      - policy_data = {
                          - enabled = true
                        }
                      - policy_type = "metrics"
                    },
                ]
            }
        ) -> null
      - destroy_method  = "GET" -> null
      - destroy_path    = "//eu-gb.kms.cloud.ibm.com/api/v2/instance/policies?policy=metrics" -> null
      - id              = "0eff8174-e741-4e35-b58d-ffcf549e2bce" -> null
      - id_attribute    = "0eff8174-e741-4e35-b58d-ffcf549e2bce" -> null
      - object_id       = "0eff8174-e741-4e35-b58d-ffcf549e2bce" -> null
      - path            = "//eu-gb.kms.cloud.ibm.com/api/v2/instance/policies?policy=metrics" -> null
      - read_path       = "//eu-gb.kms.cloud.ibm.com/api/v2/instance/policies?policy=metrics" -> null
      - update_method   = "PUT" -> null
      - update_path     = "//eu-gb.kms.cloud.ibm.com/api/v2/instance/policies?policy=metrics" -> null
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + key_protect_instance_policies = {
      + dual_auth_delete         = [
          + {
              + created_by    = (known after apply)
              + creation_date = (known after apply)
              + enabled       = false
              + last_updated  = (known after apply)
              + updated_by    = (known after apply)
            },
        ]
      + id                       = (known after apply)
      + instance_id              = "0eff8174-e741-4e35-b58d-ffcf549e2bce"
      + key_create_import_access = [
          + {
              + create_root_key     = true
              + create_standard_key = true
              + created_by          = (known after apply)
              + creation_date       = (known after apply)
              + enabled             = true
              + enforce_token       = false
              + import_root_key     = true
              + import_standard_key = true
              + last_updated        = (known after apply)
              + updated_by          = (known after apply)
            },
        ]
      + metrics                  = [
          + {
              + created_by    = (known after apply)
              + creation_date = (known after apply)
              + enabled       = true
              + last_updated  = (known after apply)
              + updated_by    = (known after apply)
            },
        ]
      + rotation                 = [
          + {
              + created_by     = (known after apply)
              + creation_date  = (known after apply)
              + enabled        = true
              + interval_month = 1
              + last_updated   = (known after apply)
              + updated_by     = (known after apply)
            },
        ]
      + timeouts                 = null
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

So, while it does say it is removing the resource, my findings have been that actually removing the RestAPI resource never actually affects the metrics setting on the Key Protect instance so there are no issues here with any period of time where metrics won't be sent. 

If I were to outline the steps, I would say the following would suffice:
1. update to latest version of this module
2. run `terraform state rm "module.key_protect_module.restapi_object.enable_metrics[0]"`
3. run terraform apply to apply the latest changes for the module.